tests/artillery-baseline-microservices-10vu.yml
# Artillery Load Test Configuration - Low Load (10 VU)
# Target: Jelita Microservices (Auth + Health Only)  
# Duration: 2 minutes
# Purpose: Compare with monolith at same load level

config:
  target: 'http://localhost:3001'
  phases:
    - duration: 120
      arrivalRate: 10
      name: 'Low Load - 10 VU'
  plugins:
    expect: {}

scenarios:
  # 70% - User Authentication
  - name: 'User Authentication'
    weight: 70
    flow:
      # Sign in
      - post:
          url: '/api/auth/signin'
          json:
            username: 'pemohon{{ $randomNumber(1, 50) }}'
            password: 'password123'
          capture:
            - json: '$.data.accessToken'
              as: 'token'
          expect:
            - statusCode: 200
      
      - think: 2
      
      # Verify token by checking health
      - get:
          url: 'http://localhost:3001/health'
          expect:
            - statusCode: 200

  # 20% - Admin Authentication
  - name: 'Admin Authentication'
    weight: 20
    flow:
      - post:
          url: '/api/auth/signin'
          json:
            username: 'admin{{ $randomNumber(1, 10) }}'
            password: 'password123'
          capture:
            - json: '$.data.accessToken'
              as: 'token'
          expect:
            - statusCode: 200
      
      - think: 2
      
      - get:
          url: 'http://localhost:3001/health'
          expect:
            - statusCode: 200

  # 10% - Service Health Check
  - name: 'Service Health Check'
    weight: 10
    flow:
      # Check all services health
      - get:
          url: 'http://localhost:3001/health'
          expect:
            - statusCode: 200
      - get:
          url: 'http://localhost:3010/health'
          expect:
            - statusCode: 200
      - get:
          url: 'http://localhost:3020/health'
          expect:
            - statusCode: 200
      - get:
          url: 'http://localhost:3030/health'
          expect:
            - statusCode: 200
      - get:
          url: 'http://localhost:3040/health'
          expect:
            - statusCode: 200